In [1]:
# ADVANCED DATABASES - LAB #6
# Filtering data in SQLAlchemy

In [2]:
from sqlalchemy import create_engine

# database_type://user:password@database_url:port/database_name
db_string = 'postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb'

# create_engine is just interface to connection database with program
db = create_engine(db_string)

In [3]:
# We can use a script to initialize mapper operation
from sqlalchemy import create_engine, MetaData, Table

metadata = MetaData()

dic_table = {}
for table_name in db.table_names():
    dic_table[table_name] = Table(table_name, metadata , autoload=True, autoload_with=db)

In [4]:
print(repr(dic_table['category']))

Table('category', MetaData(bind=None), Column('category_id', INTEGER(), table=<category>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x7fd95809ea50>, for_update=False)), Column('name', VARCHAR(length=25), table=<category>, nullable=False), Column('last_update', TIMESTAMP(), table=<category>, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x7fd95809e390>, for_update=False)), schema=None)

In [5]:
# EXERCISE 1
# How many categories of films we have in the rental?

from sqlalchemy import select

mapper_stmt1 = "SELECT count(category.name) FROM category"
result1 = db.execute(mapper_stmt1).fetchall()

In [6]:
print(result1)
# 1 result

[(16,)]

In [7]:
# EXERCISE 2
# Display list of categories in alphabetic order.

mapper_stmt2 = select([dic_table['category'].columns.name]).order_by(dic_table['category'].columns.name) 
result2 = db.execute(mapper_stmt2).fetchall()

In [8]:
print(result2)
# 16 results

[('Action',), ('Animation',), ('Children',), ('Classics',), ('Comedy',), ('Documentary',), ('Drama',), ('Family',), ('Foreign',), ('Games',), ('Horror',), ('Music',), ('New',), ('Sci-Fi',), ('Sports',), ('Travel',)]

In [9]:
# EXERCISE 3
# Find the oldest and youngest film in rental.


mapper_stmt3 = " SELECT title, year, date FROM \
                 ( \
                     SELECT film.title AS title, film.release_year AS year, rental.return_date AS date FROM film \
                         INNER JOIN inventory ON film.film_id = inventory.film_id \
                         INNER JOIN rental ON inventory.inventory_id = rental.inventory_id \
                     GROUP BY title, year, date) \
                AS temp_table \
                WHERE year = (SELECT MAX(film.release_year) FROM film) OR \
                      year = (SELECT MIN(film.release_year) FROM film) AND \
                      date IS NULL "

result3 = db.execute(mapper_stmt3).fetchall()

In [10]:
#for i in result3:
#    print(i)

# 16030 results

In [11]:
# EXERCISE 4
# How many rentals were in between 2005-07-01 and 2005-08-01?
from sqlalchemy import and_
import datetime

mapper_stmt4 = select( [dic_table['rental']]).\
                      where(and_(dic_table['rental'].columns.rental_date > datetime.datetime(2006, 7, 1),\
                                 dic_table['rental'].columns.rental_date < datetime.datetime(2006, 8, 1)))

result4 = db.execute(mapper_stmt4).fetchall()
result4_length = len(result4)

In [12]:
print(result4_length)
# 0 results

0

In [13]:
# EXERCISE 5
# How many rentals were in between 2010-01-01 and 2011-02-01?

mapper_stmt5 = select([dic_table['rental']]).\
                       where(and_(dic_table['rental'].columns.rental_date > datetime.datetime(2010, 1, 1),\
                                  dic_table['rental'].columns.rental_date < datetime.datetime(2011, 2, 1) ) )

result5 = db.execute(mapper_stmt5).fetchall()
result5_length = len(result5)

In [14]:
print(result5_length)
# 0 results

0

In [15]:
# EXERCISE 6
# Find the biggest payment in the rental.

mapper_stmt6 = 'SELECT max(payment.amount) from payment'
result6 = db.execute(mapper_stmt6).fetchall()

In [16]:
print(result6)
# 1 result

[(Decimal('11.99'),)]

In [17]:
# EXERCISE 7
# Find all customers from Poland, Nigeria or Bangladesh.

mapper_stmt7 = " SELECT customer.first_name, customer.last_name, country.country from customer \
                INNER JOIN address on address.address_id = customer.address_id \
                INNER JOIN city on city.city_id = address.city_id \
                INNER JOIN country on country.country_id = city.country_id \
            WHERE (country.country = 'Poland' or country.country = 'Nigeria' or country.country = 'Bangladesh') \
            GROUP BY customer.first_name, customer.last_name, country.country "

result7 = db.execute(mapper_stmt7).fetchall()

In [18]:
for i in result7:
    print(i)
# 24 results

('Bertha', 'Ferguson', 'Nigeria')
('Brian', 'Wyman', 'Poland')
('Carol', 'Garcia', 'Nigeria')
('Constance', 'Reid', 'Nigeria')
('Elsie', 'Kelley', 'Nigeria')
('Frank', 'Waggoner', 'Bangladesh')
('Gladys', 'Hamilton', 'Nigeria')
('Jimmie', 'Eggleston', 'Poland')
('Jo', 'Fowler', 'Nigeria')
('Johnnie', 'Chisholm', 'Poland')
('Leah', 'Curtis', 'Poland')
('Marilyn', 'Ross', 'Nigeria')
('Marjorie', 'Tucker', 'Poland')
('Michelle', 'Clark', 'Bangladesh')
('Olga', 'Jimenez', 'Nigeria')
('Rodney', 'Moeller', 'Nigeria')
('Ruben', 'Geary', 'Poland')
('Russell', 'Brinson', 'Poland')
('Sidney', 'Burleson', 'Poland')
('Sonia', 'Gregory', 'Nigeria')
('Stephen', 'Qualls', 'Bangladesh')
('Tracey', 'Barrett', 'Nigeria')
('Velma', 'Lucas', 'Nigeria')
('Wallace', 'Slone', 'Nigeria')

In [19]:
# EXERCISE 8
# Where staff memebers live?

mapper_stmt8 = " SELECT staff.first_name AS name, staff.last_name AS surname, address.address AS street, \
                city.city AS cityName, country.country AS countryName FROM staff \
                    INNER JOIN address ON address.address_id = staff.address_id \
                    INNER JOIN city ON city.city_id = address.city_id \
                    INNER JOIN country ON country.country_id = city.country_id \
                GROUP BY name, surname, street, cityName, countryName "

result8 = db.execute(mapper_stmt8).fetchall()

In [20]:
for i in result8:
    print(i)
# 2 results

('Jon', 'Stephens', '1411 Lillydale Drive', 'Woodridge', 'Australia')
('Mike', 'Hillyer', '23 Workhaven Lane', 'Lethbridge', 'Canada')

In [21]:
# EXERCISE 9
# How many staff members live in Argentina or Spain?

mapper_stmt9 = " SELECT COUNT (*) FROM \
                ( \
                    SELECT staff.first_name as staffName, staff.last_name as surname, address.address as street, \
                    city.city as cityName, country.country as countryName FROM staff \
                        INNER JOIN address ON address.address_id = staff.address_id \
                        INNER JOIN city ON city.city_id = address.city_id \
                        INNER JOIN country ON country.country_id = city.country_id \
                    GROUP BY staffName, surname, street, cityName, countryName \
                ) AS temp_table \
                WHERE countryName = 'Argentina' OR countryName = 'Spain' "

result9 = db.execute(mapper_stmt9).fetchall()

In [22]:
for i in result9:
    print(i)
# 0 results

(0,)

In [23]:
# EXERCISE 10
# Which categories of the films were rented by clients?

mapper_stmt10 = " SELECT distinct category.name FROM category \
                    INNER JOIN film_category ON category.category_id = film_category.category_id \
                    INNER JOIN film ON film_category.film_id = film.film_id \
                    INNER JOIN inventory ON film.film_id = inventory.film_id \
                    INNER JOIN rental ON rental.inventory_id = inventory.inventory_id \
                ORDER BY category.name "

result10 = db.execute(mapper_stmt10).fetchall()

In [24]:
for i in result10:
    print(i)
# 16 results

('Action',)
('Animation',)
('Children',)
('Classics',)
('Comedy',)
('Documentary',)
('Drama',)
('Family',)
('Foreign',)
('Games',)
('Horror',)
('Music',)
('New',)
('Sci-Fi',)
('Sports',)
('Travel',)

In [25]:
# EXERCISE 11
# Find all categories of films rented in America.

mapper_stmt11 = " SELECT distinct category.name FROM category \
                    INNER JOIN film_category ON category.category_id = film_category.category_id \
                    INNER JOIN film ON film_category.film_id = film.film_id \
                    INNER JOIN inventory ON film.film_id = inventory.film_id \
                    INNER JOIN rental ON rental.inventory_id = inventory.inventory_id \
                    INNER JOIN customer ON rental.customer_id = customer.customer_id \
                    INNER JOIN address ON customer.address_id = address.address_id \
                    INNER JOIN city ON address.city_id = city.city_id \
                    INNER JOIN country ON city.country_id = country.country_id \
                WHERE country.country = 'America' \
                ORDER BY category.name "

result11 = db.execute(mapper_stmt11).fetchall()
length_task11 = len(result11)

In [26]:
print(length_task11)
# 0 results

0

In [27]:
# EXERCISE 12
# Find all title of films where one of these actors played: ,,Olympia Pfeiffer", ,,Julia Zellweger" or ,,Ellen Presley"

mapper_stmt12 = " SELECT film.title, actor.first_name, actor.last_name FROM film \
                    INNER JOIN film_actor ON film_actor.film_id = film.film_id \
                    INNER JOIN actor ON actor.actor_id = film_actor.actor_id \
                WHERE (actor.first_name = 'Olympia' AND actor.last_name = 'Pfeiffer') OR \
                      (actor.first_name = 'Julia' AND actor.last_name = 'Zellweger') OR \
                      (actor.first_name = 'Ellen' AND actor.last_name = 'Presley') \
                ORDER BY film.title "

result12 = db.execute(mapper_stmt12).fetchall()
result12_length = len(result12)

In [28]:
print(result12_length)
# 69 results

69